app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "assignments" ON "tags"."id" = "assignments"."tag_id" WHERE "assignments"."post_id" = 2
---
          <p class="tags clearfix">
          	<% post.tags.each do |tag| %>