app/controllers/downvote_posts_controller.rb

  def create
    if current_user
      post = DownvotePost.find(:first, :conditions => { :user_id => current_user.id, :post_id => params[:post_id] })
      if post
        flash.keep[:notice] = 'Already added into seen'
       else
         post = DownvotePost.new
         post.user_id = current_user.id
         post.post_id = params[:post_id]
         post.save
---
SELECT "downvote_posts".* FROM "downvote_posts" WHERE "downvote_posts"."user_id" = 1 AND "downvote_posts"."post_id" = 1 LIMIT 1
INSERT INTO "downvote_posts" ("created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Sep 2013 13:09:09 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 03 Sep 2013 13:09:09 UTC +00:00], ["user_id", 1]]