app/controllers/posts_controller.rb

  def create

    @post = Post.new
    @post.title  = params[:title]
    @post.url = params[:url]
    @post.description = params[:description]

    if current_user
      @post.user_id = current_user.id
    else
      @post.user_id = 1
    end

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id", "vote") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Tue, 03 Sep 2013 11:16:38 UTC +00:00], ["description", nil], ["title", nil], ["updated_at", Tue, 03 Sep 2013 11:16:38 UTC +00:00], ["url", nil], ["user_id", nil], ["vote", nil]]