app/controllers/seen_posts_controller.rb

SELECT "seen_posts".* FROM "seen_posts" WHERE "seen_posts"."user_id" = 1 AND "seen_posts"."post_id" = 1 LIMIT 1
INSERT INTO "seen_posts" ("created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Sep 2013 12:55:19 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 03 Sep 2013 12:55:19 UTC +00:00], ["user_id", 1]]
---
  def create
    if current_user
      post = SeenPost.find(:first, :conditions => { :user_id => current_user.id, :post_id => params[:post_id] })
      if post
        flash.keep[:notice] = 'Already added into seen'
       else
         post = SeenPost.new
         post.user_id = current_user.id
         post.post_id = params[:post_id]
         post.save